{"title":{"0":"NASA's Mars 2020 Comes Full Circle","1":"The Detective Aboard NASA's Perseverance Rover","2":"Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch","3":"NASA Administrator Statement on Moon to Mars Initiative, FY 2021 Budget","4":"NASA's Mars 2020 Rover Completes Its First Drive","5":"NASA's Mars 2020 Heads Into the Test Chamber","6":"NASA's Curiosity Keeps Rolling As Team Operates Rover From Home","7":"3 Things We've Learned From NASA's Mars InSight ","8":"NASA's New Mars Rover Is Ready for Space Lasers","9":"New Selfie Shows Curiosity, the Mars Chemist","10":"Naming a NASA Mars Rover Can Change Your Life","11":"While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus","12":"NASA's Mars Reconnaissance Orbiter Undergoes Memory Update","13":"NASA Invites Students to Name Mars 2020 Rover","14":"Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest"},"preview":{"0":"Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL. ","1":"An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals.","2":"A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff.","3":"Jim Bridenstine addresses NASA's ambitious plans for the coming years, including Mars Sample Return.","4":"In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps.","5":"In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions.","6":"The team has learned to meet new challenges as they work remotely on the Mars mission.","7":"Scientists are finding new mysteries since the geophysics mission landed two years ago.","8":"Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future.","9":"The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait.","10":"Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking.","11":"This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars.","12":"Other orbiters will continue relaying data from Mars surface missions for a two-week period.","13":"Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover.","14":"Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}}